ezois_ka/oooezoiskaobmen/src/InformationRegisters/НастройкиПечатныхФормБЗК/НастройкиПечатныхФормБЗК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиПечатныхФормБЗК</name>
  <resources>
    <name>СодержимоеДокумента</name>
    <type>
      <types>EnumRef.СодержимоеДокументов</types>
    </type>
  </resources>
  <resources>
    <name>БлокировкаСУсловием</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НаСписокСотрудников</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьКодДокументаКадровогоМероприятия</name>
    <type>
      <types>CatalogRef.КодыДокументовКадровыхМероприятий</types>
    </type>
  </resources>
  <resources>
    <name>ВариантПодписания</name>
    <type>
      <types>EnumRef.ВариантыПодписанияДокументовЭДОБЗК</types>
    </type>
  </resources>
  <resources>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.ВидыДокументовЭДОБЗК</types>
    </type>
  </resources>
  <attributes>
    <name>Предопределенный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательскоеНаименование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИдентификаторПечатнойФормы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ezois_ka/oooezoiskaobmen/src/InformationRegisters/НастройкиПечатныхФормБЗК/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// БлокировкаИзмененияОбъектов
	БлокировкаИзмененияОбъектов.ПриСозданииНаСервереЗаблокированнойФормыСписка(ЭтотОбъект, Элементы.ФормаКоманднаяПанель);
	// Конец БлокировкаИзмененияОбъектов
	
	УстановитьУсловноеОформление();
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ВариантПодписания",
		"Видимость",
		ИнтеграцияКабинетСотрудника.ИспользуетсяВерсияDTO("2.1"));
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ВариантПодписанияЗаполненный",
		"Видимость",
		ИнтеграцияКабинетСотрудника.ИспользуетсяВерсияDTO("2.1"));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	ОткрытьФормуВводаНовойЗаписи();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// БлокировкаИзмененияОбъектов

&НаКлиенте
Процедура Подключаемый_РазблокироватьОбъекты(Команда)
	
	БлокировкаИзмененияОбъектовКлиент.РазблокироватьФормуСписка(ЭтотОбъект);
	
КонецПроцедуры

// Конец БлокировкаИзмененияОбъектов

&НаКлиенте
Процедура ДобавитьИдентификаторыВнешнихПечатныхФорм(Команда)
	
	СписокВнешнихПечатныхФорм = ИдентификаторыВнешнихПечатныхФорм();
	Если СписокВнешнихПечатныхФорм.Количество() = 0 Тогда
		ТекстПредупреждения = НСтр("ru = 'Не найдено подключенных внешних печатных форм'");
		ПоказатьПредупреждение(, ТекстПредупреждения);
	Иначе
		Оповещение = Новый ОписаниеОповещения("ОбработатьВыборВнешнейПечатнойФормы", ЭтотОбъект);
		СписокВнешнихПечатныхФорм.ПоказатьВыборЭлемента(Оповещение, НСтр("ru = 'Выберите печатную форму'"), );
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработатьВыборВнешнейПечатнойФормы(ОписаниеПечатнойФормы, ДополнительныеПараметры) Экспорт
	
	Если ОписаниеПечатнойФормы <> Неопределено Тогда
		ОткрытьФормуВводаНовойЗаписи(ОписаниеПечатнойФормы.Значение, ОписаниеПечатнойФормы.Представление);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеДобавленияИдентификатора(Результат, ДополнительныеПараметры) Экспорт
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

&НаСервере
Функция ИдентификаторыВнешнихПечатныхФорм()
	
	ВнешниеПечатныеФормы = Новый СписокЗначений;
	
	ВнешниеПечатныеФормыБазыДанных = Новый СписокЗначений;
	ДополнительныеОтчетыИОбработки.ПриПолученииСпискаВнешнихПечатныхФорм(ВнешниеПечатныеФормыБазыДанных, Неопределено);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВнешниеПечатныеФормыБазыДанных", ВнешниеПечатныеФормыБазыДанных);
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДополнительныеОтчетыИОбработкиКоманды.Идентификатор КАК Идентификатор,
		|	ДополнительныеОтчетыИОбработкиКоманды.Представление КАК Представление,
		|	ЕСТЬNULL(ДополнительныеОтчетыИОбработкиНазначение.ОбъектНазначения.ПолноеИмя, """") КАК ПолноеИмяОбъектаМетаданных
		|ИЗ
		|	Справочник.ДополнительныеОтчетыИОбработки.Команды КАК ДополнительныеОтчетыИОбработкиКоманды
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДополнительныеОтчетыИОбработки.Назначение КАК ДополнительныеОтчетыИОбработкиНазначение
		|		ПО ДополнительныеОтчетыИОбработкиКоманды.Ссылка = ДополнительныеОтчетыИОбработкиНазначение.Ссылка
		|ГДЕ
		|	ДополнительныеОтчетыИОбработкиКоманды.Идентификатор В(&ВнешниеПечатныеФормыБазыДанных)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Идентификатор,
		|	ПолноеИмяОбъектаМетаданных";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("Идентификатор") Цикл
		
		ДобавитьИдентификатор = Ложь;
		ПредставленияОбъектовМетаданных = Новый Массив;
		Пока Выборка.Следующий() Цикл
			
			Если Не ПустаяСтрока(Выборка.ПолноеИмяОбъектаМетаданных)
				И ЭДОБЗК.ЭтоТипОбъектаСПечатнымиФормами(
					ТипЗнч(ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(
						Выборка.ПолноеИмяОбъектаМетаданных).ПустаяСсылка())) Тогда
				
				Если ПредставленияОбъектовМетаданных.Количество() = 4 Тогда
					ПредставленияОбъектовМетаданных.Добавить("...");
					Прервать;
				ИначеЕсли ПредставленияОбъектовМетаданных.Количество() < 4 Тогда
					ПредставленияОбъектовМетаданных.Добавить(Метаданные.НайтиПоПолномуИмени(Выборка.ПолноеИмяОбъектаМетаданных).Представление());
				КонецЕсли;
				
				ДобавитьИдентификатор = Истина;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ДобавитьИдентификатор Тогда
			Представление = Выборка.Представление + ": (" + СтрСоединить(ПредставленияОбъектовМетаданных, ", ") + ")";
			ВнешниеПечатныеФормы.Добавить(Выборка.Идентификатор, Представление);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ВнешниеПечатныеФормы;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуВводаНовойЗаписи(ИдентификаторПечатнойФормы = "", Наименование = "")
	
	ПараметрыОткрытия = Новый Структура;
	Если ЗначениеЗаполнено(ИдентификаторПечатнойФормы) Тогда
		Если ЭДОБЗККлиентСервер.ЭтоИдентификаторыЭлектронногоДокумента(ИдентификаторПечатнойФормы) Тогда
			ПараметрыОткрытия.Вставить("Ключ", КлючЗаписиПоИдентификаторуПечатнойФормы(ИдентификаторПечатнойФормы));
		Иначе
			ЗначенияЗаполнения = Новый Структура;
			ЗначенияЗаполнения.Вставить("ИдентификаторПечатнойФормы", ИдентификаторПечатнойФормы);
			ЗначенияЗаполнения.Вставить("Наименование", Наименование);
			ЗначенияЗаполнения.Вставить("ВидДокумента", ОбщегоНазначенияКлиент.ПредопределенныйЭлемент("Справочник.ВидыДокументовЭДОБЗК.Прочие"));
			ПараметрыОткрытия.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
		КонецЕсли;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПослеДобавленияИдентификатора", ЭтотОбъект);
	ОткрытьФорму("РегистрСведений.НастройкиПечатныхФормБЗК.ФормаЗаписи", ПараметрыОткрытия, ЭтотОбъект,
		Истина, , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция КлючЗаписиПоИдентификаторуПечатнойФормы(ИдентификаторПечатнойФормы)
	
	Возврат РегистрыСведений.НастройкиПечатныхФормБЗК.СоздатьКлючЗаписи(
		Новый Структура("ИдентификаторПечатнойФормы", ИдентификаторПечатнойФормы))
	
КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	// Наименование печатной формы
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("Наименование");
	
	ОтборЭлемента = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.Наименование");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра(
		"Текст", Новый ПолеКомпоновкиДанных("Список.ИдентификаторПечатнойФормы"));
	
	// Подсвечивание незаполненных видов документов
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ВидДокумента");
	
	ОтборЭлемента = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.ВидДокумента");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
	
КонецПроцедуры

#КонецОбласти
